In [1]:
import pandas as pd

In [2]:
data=pd.DataFrame({
    "Ram":[56,61,87,45,78],
    "Sita":[89,34,87,45,69],
    "Hari":[98,43,65,76,34],
    "Rita":[56,12,87,67,45],
    "Shyam":[78,45,76,45,39]
})
data

   Hari  Ram  Rita  Shyam  Sita
0    98   56    56     78    89
1    43   61    12     45    34
2    65   87    87     76    87
3    76   45    67     45    45
4    34   78    45     39    69

In [5]:
data.mean(axis=0)
data.median(axis=0)
data.mode()

   Hari  Ram  Rita  Shyam  Sita
0    34   45    12   45.0    34
1    43   56    45    NaN    45
2    65   61    56    NaN    69
3    76   78    67    NaN    87
4    98   87    87    NaN    89

In [12]:
data.var()

Hari     659.7
Ram      287.3
Rita     776.3
Shyam    353.3
Sita     609.2
dtype: float64

In [13]:
(((data['Hari']-data['Hari'].mean())**2).sum())/(len(data['Hari'])-1)

659.7

In [14]:
data.var(ddof=0)

Hari     527.76
Ram      229.84
Rita     621.04
Shyam    282.64
Sita     487.36
dtype: float64

In [15]:
(((data['Hari']-data['Hari'].mean())**2).sum())/(len(data['Hari']))

527.76

In [16]:
data.std()

Hari     25.684626
Ram      16.949926
Rita     27.862161
Shyam    18.796276
Sita     24.681977
dtype: float64

In [17]:
data.std(ddof=0)

Hari     22.973028
Ram      15.160475
Rita     24.920674
Shyam    16.811901
Sita     22.076232
dtype: float64